In [ ]:
import warnings
warnings.filterwarnings('ignore')

In [ ]:
import pandas as pd
import numpy as np

data = pd.read_csv('/train.csv')
print(data)

      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage  \
0                 41000    Diesel       Manual      First  19.67 kmpl
1                 46000    Petrol       Manual      First    13 km/kg
2                 87000    Diesel       Manual      First  20.77 kmpl
3                 40670    Diesel    Automatic     Second   15.2 kmpl
4                 86999    Diesel       Manual      First  23.08 kmpl
...                 ...       ...          ...        ...         ...
5842              27365    Diesel       Manual      First   28.4 kmpl
5843             100000    Diesel       Manual      First   24.4 kmpl
5844              55000    Diesel       Manual     Second   14.0 kmpl
5845              46000    Petrol       Manual      First   18.9 kmpl
5846              47000    Diesel       Manual      First  25.44 kmpl

       Engine      Power  Seats  New_Price  Price
0     1582 CC  126.2 bhp    5.0        NaN  12.50
1     1199 CC   88.7 bhp    5.0  8.61 Lakh   4.50
2     1248 CC  88.76 bhp    7.0        NaN   6.00
3     1968 CC  140.8 bhp    5.0        NaN  17.74
4     1461 CC   63.1 bhp    5.0        NaN   3.50
...       ...        ...    ...        ...    ...
5842  1248 CC     74 bhp    5.0  7.88 Lakh   4.75
5843  1120 CC     71 bhp    5.0        NaN   4.00
5844  2498 CC    112 bhp    8.0        NaN   2.90
5845   998 CC   67.1 bhp    5.0        NaN   2.65
5846   936 CC   57.6 bhp    5.0        NaN   2.50

[5847 rows x 14 columns]

# **a) Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them. Justify your action for this task.]**

In [ ]:
missing_values = data.isnull().sum()
print(missing_values)

Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [ ]:
dataframe_orginal=pd.DataFrame(data)
dataframe_cleaned=dataframe_orginal.dropna(subset=['Mileage','Engine','Power','Seats','New_Price'])
dataframe_cleaned.reset_index(drop=True,inplace=True)
print("original data:",dataframe_cleaned.shape)
print("dataframe",dataframe_cleaned.shape)
print(dataframe_cleaned)
dataframe_cleaned.to_csv('cleaned_data.csv')

original data: (814, 14)
dataframe (814, 14)
     Unnamed: 0                               Name Location  Year  \
0             2                       Honda Jazz V  Chennai  2011
1             7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
2            10                   Maruti Ciaz Zeta    Kochi  2018
3            15        Mitsubishi Pajero Sport 4X4    Delhi  2014
4            20                  BMW 3 Series 320d    Kochi  2014
..          ...                                ...      ...   ...
809        5999              Tata Bolt Revotron XT  Chennai  2016
810        6002      Volkswagen Vento 1.6 Highline   Mumbai  2011
811        6005           Maruti Vitara Brezza VDi     Pune  2016
812        6010               Honda Brio 1.2 VX MT    Delhi  2013
813        6014                   Maruti Swift VDI    Delhi  2014

     Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage   Engine  \
0                46000    Petrol       Manual      First    13 km/kg  1199 CC
1                36000    Diesel    Automatic      First  11.36 kmpl  2755 CC
2                25692    Petrol       Manual      First  21.56 kmpl  1462 CC
3               110000    Diesel       Manual      First   13.5 kmpl  2477 CC
4                32982    Diesel    Automatic      First  22.69 kmpl  1995 CC
..                 ...       ...          ...        ...         ...      ...
809              10000    Petrol       Manual      First  17.57 kmpl  1193 CC
810              38000    Petrol       Manual      First  16.09 kmpl  1598 CC
811              37208    Diesel       Manual      First   24.3 kmpl  1248 CC
812              33746    Petrol       Manual      First   18.5 kmpl  1198 CC
813              27365    Diesel       Manual      First   28.4 kmpl  1248 CC

          Power  Seats   New_Price  Price
0      88.7 bhp    5.0   8.61 Lakh   4.50
1     171.5 bhp    8.0     21 Lakh  17.50
2    103.25 bhp    5.0  10.65 Lakh   9.95
3    175.56 bhp    7.0  32.01 Lakh  15.00
4       190 bhp    5.0  47.87 Lakh  18.55
..          ...    ...         ...    ...
809    88.7 bhp    5.0   7.77 Lakh   4.00
810   103.5 bhp    5.0  11.91 Lakh   3.25
811    88.5 bhp    5.0   9.93 Lakh   7.43
812    86.8 bhp    5.0   6.63 Lakh   3.20
813      74 bhp    5.0   7.88 Lakh   4.75

[814 rows x 14 columns]

# **Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from “New_price”).**

In [ ]:
dataframe_cleaned.loc[:, 'Mileage'] = dataframe_cleaned['Mileage'].astype(str).str.replace(r' kmpl| km/kg', '', regex=True).astype(float)

dataframe_cleaned['Engine'] = dataframe_cleaned['Engine'].astype(str).str.replace(' CC', '')
dataframe_cleaned['Engine'] = dataframe_cleaned['Engine'].replace('nan', np.nan)
dataframe_cleaned['Engine'] = dataframe_cleaned['Engine'].astype(float).fillna(0).astype(int)

dataframe_cleaned['Power'] = dataframe_cleaned['Power'].astype(str).str.replace(' bhp', '').astype(float)

dataframe_cleaned['New_Price'] = dataframe_cleaned['New_Price'].astype(str).str.replace(r' Lakh| Cr', '', regex=True).astype(float)

print(dataframe_cleaned.head())

dataframe_cleaned.to_csv('no_units_data.csv')

   Unnamed: 0                               Name Location  Year  \
0           2                       Honda Jazz V  Chennai  2011
1           7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
2          10                   Maruti Ciaz Zeta    Kochi  2018
3          15        Mitsubishi Pajero Sport 4X4    Delhi  2014
4          20                  BMW 3 Series 320d    Kochi  2014

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              46000    Petrol       Manual      First    13.00    1199
1              36000    Diesel    Automatic      First    11.36    2755
2              25692    Petrol       Manual      First    21.56    1462
3             110000    Diesel       Manual      First    13.50    2477
4              32982    Diesel    Automatic      First    22.69    1995

    Power  Seats  New_Price  Price
0   88.70    5.0       8.61   4.50
1  171.50    8.0      21.00  17.50
2  103.25    5.0      10.65   9.95
3  175.56    7.0      32.01  15.00
4  190.00    5.0      47.87  18.55

# **Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.**

In [ ]:
hot_encoded = pd.get_dummies(data, columns=['Fuel_Type', 'Transmission'])
print(hot_encoded.head())
hot_encoded.to_csv('hot_encoded.csv')

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type     Mileage   Engine      Power  Seats  \
0              41000      First  19.67 kmpl  1582 CC  126.2 bhp    5.0
1              46000      First    13 km/kg  1199 CC   88.7 bhp    5.0
2              87000      First  20.77 kmpl  1248 CC  88.76 bhp    7.0
3              40670     Second   15.2 kmpl  1968 CC  140.8 bhp    5.0
4              86999      First  23.08 kmpl  1461 CC   63.1 bhp    5.0

   New_Price  Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  \
0        NaN  12.50                 1                   0                 0
1  8.61 Lakh   4.50                 0                   0                 1
2        NaN   6.00                 1                   0                 0
3        NaN  17.74                 1                   0                 0
4        NaN   3.50                 1                   0                 0

   Transmission_Automatic  Transmission_Manual
0                       0                    1
1                       0                    1
2                       0                    1
3                       1                    0
4                       0                    1

# **Create one more feature and add this column to the dataset (you can use mutate function in R for this). For example, you can calculate the current age of the car by subtracting “Year” value from the current year. **

In [ ]:
import pandas as pd
from datetime import datetime

current_year = datetime.now().year
dataframe_cleaned['Current_Age'] = current_year - dataframe_cleaned['Year']
print(dataframe_cleaned.head())
dataframe_cleaned.to_csv('current_age.csv')

   Unnamed: 0                               Name Location  Year  \
0           2                       Honda Jazz V  Chennai  2011
1           7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
2          10                   Maruti Ciaz Zeta    Kochi  2018
3          15        Mitsubishi Pajero Sport 4X4    Delhi  2014
4          20                  BMW 3 Series 320d    Kochi  2014

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              46000      First    13.00    1199   88.70    5.0       8.61
1              36000      First    11.36    2755  171.50    8.0      21.00
2              25692      First    21.56    1462  103.25    5.0      10.65
3             110000      First    13.50    2477  175.56    7.0      32.01
4              32982      First    22.69    1995  190.00    5.0      47.87

   Price  Fuel_Type_Diesel  Fuel_Type_Petrol  Transmission_Automatic  \
0   4.50                 0                 1                       0
1  17.50                 1                 0                       1
2   9.95                 0                 1                       0
3  15.00                 1                 0                       0
4  18.55                 1                 0                       1

   Transmission_Manual  Current_Age
0                    1           13
1                    0            8
2                    1            6
3                    1           10
4                    0           10

# Perform select, filter, rename, mutate, arrange and summarize with group by operations (or) their equivalent operations in python) on this dataset.

In [ ]:
selected_dataframe_cleaned = dataframe_cleaned[['Location', 'Year', 'Price']]
print(selected_dataframe_cleaned)
selected_dataframe_cleaned.to_csv('selected_data.csv')

    Location  Year  Price
0    Chennai  2011   4.50
1     Mumbai  2016  17.50
2      Kochi  2018   9.95
3      Delhi  2014  15.00
4      Kochi  2014  18.55
..       ...   ...    ...
809  Chennai  2016   4.00
810   Mumbai  2011   3.25
811     Pune  2016   7.43
812    Delhi  2013   3.20
813    Delhi  2014   4.75

[814 rows x 3 columns]

In [ ]:
filtered_dataframe_cleaned = dataframe_cleaned[dataframe_cleaned['Year'] > 2015]
print(filtered_dataframe_cleaned)
filtered_dataframe_cleaned.to_csv('filtered_data.csv')

     Unnamed: 0                               Name Location  Year  \
1             7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
2            10                   Maruti Ciaz Zeta    Kochi  2018
5            28                Honda WRV i-VTEC VX    Kochi  2018
7            36      Maruti Vitara Brezza ZDi Plus    Kochi  2018
10           60  Toyota Innova Crysta 2.4 GX MT 8S   Mumbai  2017
..          ...                                ...      ...   ...
805        5981                Maruti Baleno Alpha   Mumbai  2017
806        5982                      Tata Hexa XTA   Jaipur  2016
807        5987         Tata Tiago 1.2 Revotron XT    Kochi  2017
809        5999              Tata Bolt Revotron XT  Chennai  2016
811        6005           Maruti Vitara Brezza VDi     Pune  2016

     Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
1                36000      First    11.36    2755  171.50    8.0      21.00
2                25692      First    21.56    1462  103.25    5.0      10.65
5                37430      First    17.50    1199   88.70    5.0      10.57
7                50075      First    24.30    1248   88.50    5.0      11.12
10               22000      First    13.68    2393  147.80    8.0      19.34
..                 ...        ...      ...     ...     ...    ...        ...
805               6000      First    21.40    1197   83.10    5.0       8.78
806              39000      First    17.60    2179  153.86    7.0      21.00
807              15386      First    23.84    1199   84.00    5.0       5.56
809              10000      First    17.57    1193   88.70    5.0       7.77
811              37208      First    24.30    1248   88.50    5.0       9.93

     Price  Fuel_Type_Diesel  Fuel_Type_Petrol  Transmission_Automatic  \
1    17.50                 1                 0                       1
2     9.95                 0                 1                       0
5     9.90                 0                 1                       0
7     8.63                 1                 0                       0
10   16.50                 1                 0                       0
..     ...               ...               ...                     ...
805   7.50                 0                 1                       0
806  13.50                 1                 0                       1
807   5.11                 0                 1                       0
809   4.00                 0                 1                       0
811   7.43                 1                 0                       0

     Transmission_Manual  Current_Age
1                      0            8
2                      1            6
5                      1            6
7                      1            6
10                     1            7
..                   ...          ...
805                    1            7
806                    0            8
807                    1            7
809                    1            8
811                    1            8

[563 rows x 17 columns]

In [ ]:
renamed_dataframe_cleaned = dataframe_cleaned.rename(columns={'Year': 'Manufracter', 'Power': 'Horsepower'})
print(renamed_dataframe_cleaned)
renamed_dataframe_cleaned.to_csv('renamed_data.csv')

     Unnamed: 0                               Name Location  Manufracter  \
0             2                       Honda Jazz V  Chennai         2011
1             7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai         2016
2            10                   Maruti Ciaz Zeta    Kochi         2018
3            15        Mitsubishi Pajero Sport 4X4    Delhi         2014
4            20                  BMW 3 Series 320d    Kochi         2014
..          ...                                ...      ...          ...
809        5999              Tata Bolt Revotron XT  Chennai         2016
810        6002      Volkswagen Vento 1.6 Highline   Mumbai         2011
811        6005           Maruti Vitara Brezza VDi     Pune         2016
812        6010               Honda Brio 1.2 VX MT    Delhi         2013
813        6014                   Maruti Swift VDI    Delhi         2014

     Kilometers_Driven Owner_Type  Mileage  Engine  Horsepower  Seats  \
0                46000      First    13.00    1199       88.70    5.0
1                36000      First    11.36    2755      171.50    8.0
2                25692      First    21.56    1462      103.25    5.0
3               110000      First    13.50    2477      175.56    7.0
4                32982      First    22.69    1995      190.00    5.0
..                 ...        ...      ...     ...         ...    ...
809              10000      First    17.57    1193       88.70    5.0
810              38000      First    16.09    1598      103.50    5.0
811              37208      First    24.30    1248       88.50    5.0
812              33746      First    18.50    1198       86.80    5.0
813              27365      First    28.40    1248       74.00    5.0

     New_Price  Price  Fuel_Type_Diesel  Fuel_Type_Petrol  \
0         8.61   4.50                 0                 1
1        21.00  17.50                 1                 0
2        10.65   9.95                 0                 1
3        32.01  15.00                 1                 0
4        47.87  18.55                 1                 0
..         ...    ...               ...               ...
809       7.77   4.00                 0                 1
810      11.91   3.25                 0                 1
811       9.93   7.43                 1                 0
812       6.63   3.20                 0                 1
813       7.88   4.75                 1                 0

     Transmission_Automatic  Transmission_Manual  Current_Age
0                         0                    1           13
1                         1                    0            8
2                         0                    1            6
3                         0                    1           10
4                         1                    0           10
..                      ...                  ...          ...
809                       0                    1            8
810                       0                    1           13
811                       0                    1            8
812                       0                    1           11
813                       0                    1           10

[814 rows x 17 columns]

In [ ]:
mutated_data = 2024 - dataframe_cleaned['Year']
print(mutated_data)
mutated_data.to_csv('mutated_data.csv')

0      13
1       8
2       6
3      10
4      10
       ..
809     8
810    13
811     8
812    11
813    10
Name: Year, Length: 814, dtype: int64

In [ ]:
sorted_dataframe_cleaned = dataframe_cleaned.sort_values(by='Price', ascending=False)
print(sorted_dataframe_cleaned)
sorted_dataframe_cleaned.to_csv('sorted_data.csv')

     Unnamed: 0                                         Name    Location  \
542        4079  Land Rover Range Rover 3.0 Diesel LWB Vogue   Hyderabad
203        1505              Land Rover Range Rover Sport SE       Kochi
285        2095                     Mercedes-Benz SLC 43 AMG  Coimbatore
251        1885         Mercedes-Benz GLS 350d Grand Edition       Delhi
320        2319                Mercedes-Benz E-Class E 350 d  Coimbatore
..          ...                                          ...         ...
54          351                             Skoda Octavia RS      Jaipur
431        3132                         Porsche Cayenne Base       Kochi
181        1313                     Hyundai Verna CRDi 1.4 E     Chennai
303        2200                           Maruti Wagon R VXI      Mumbai
633        4863                        Hyundai Santro D Lite     Chennai

     Year  Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  \
542  2017              25000      First    13.33    2993  255.00    5.0
203  2019              26013      First    12.65    2993  255.00    5.0
285  2019               2526      First    19.00    2996  362.07    2.0
251  2018               6000      First    11.00    2987  258.00    7.0
320  2019               9312      First    18.00    2987  258.00    5.0
..    ...                ...        ...      ...     ...     ...    ...
54   2005             100000      First    14.45    1984  227.00    5.0
431  2019              14298      First    13.33    2995  340.00    5.0
181  2008             121097     Second    24.00    1396   88.76    5.0
303  2010              38000     Second    22.50     998   67.04    5.0
633  2001             140000      Third    20.30    1086   68.00    5.0

     New_Price   Price  Fuel_Type_Diesel  Fuel_Type_Petrol  \
542       2.30  160.00                 1                 0
203       1.39   97.07                 1                 0
285       1.06   83.96                 0                 1
251       1.02   79.00                 1                 0
320      92.50   78.80                 1                 0
..         ...     ...               ...               ...
54       28.37    2.05                 0                 1
431       1.36    2.02                 0                 1
181      10.73    1.90                 1                 0
303       5.61    1.75                 0                 1
633       4.55    0.70                 0                 1

     Transmission_Automatic  Transmission_Manual  Current_Age
542                       1                    0            7
203                       1                    0            5
285                       1                    0            5
251                       1                    0            6
320                       1                    0            5
..                      ...                  ...          ...
54                        1                    0           19
431                       1                    0            5
181                       0                    1           16
303                       0                    1           14
633                       0                    1           23

[814 rows x 17 columns]

In [ ]:
average_price_by_model = dataframe_cleaned.groupby('Year')['Price'].mean().reset_index()
print(average_price_by_model)
average_price_by_model.to_csv('summarized_data.csv')

    Year      Price
0   2001   0.700000
1   2004   3.000000
2   2005   2.050000
3   2007   6.000000
4   2008   2.475000
5   2009  10.950000
6   2010   7.140625
7   2011   6.754348
8   2012   7.928824
9   2013   9.877209
10  2014  10.208750
11  2015  11.942353
12  2016  13.304870
13  2017  15.765256
14  2018  15.336544
15  2019  21.956034